loadTest.yml
config:
  target: "http://localhost:8000"
  phases:
    - duration: 60
      arrivalRate: 30
      name: "Testing Load"
    # - duration: 240
    #   arrivalRate: 20
    #   rampTo: 100
    #   name: "Medium Load"

scenarios:
  - name: "Retrieve Metadata (No Indexes)"
    flow:
      - get:
          url: "/reviews/meta?product_id=5"